questions = {
    'Количество посещенных занятий': {
        'options': ['2', '3'],
        'answers': {
            '2': '____ посетил 2 занятия',
            '3': '____ посетил все три занятия наших мини-курсов'
        },
        'follow_up': {
            '2': 'Какое занятие он пропустил?',
            '3': 'Принимал активное участие?'
        }
    },
    'Принимал активное участие?': {
        'options': ['Да', 'Нет'],
        'answers': {
            'Да': '___ принимал активное участие на уроках',
            'Нет': ''
        },
        'follow_up': {
            'Да': 'Самый сильный в группе?',
            'Нет': 'Пользовался микрофоном?'
        }
    },
    'Какое занятие он пропустил?': {
        'options': ['Второе', 'Третье'],
        'answers': {
            'Второе': 'и, к сожалению, пропустил второе.',
            'Третье': 'и, к сожалению, третье занятие пропустил.'
        },
        'follow_up': {
            'Второе': 'Принимал активное участие?',
            'Третье': 'Принимал активное участие?'
        }
    },
    'Самый сильный в группе?': {
        'options': ['Да', 'Нет'],
        'answers': {
            'Да': 'Самый сильный в группе ученик - крутой',
            'Нет': ''
        },
        'follow_up': {
            'Да': 'Задавал вопросы?',
            'Нет': 'Самый активный в группе?'
        }
    },
    'Самый активный в группе?': {
        'options': ['Да', 'Нет'],
        'answers': {
            'Да': 'Самый активный в группе ученик - молодец',
            'Нет': ''
        },
        'follow_up': {
            'Да': 'Задавал вопросы?',
            'Нет': 'Пользовался микрофоном?'
        }
    },
#     'Вопрос 6': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     'Вопрос 7': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     'Вопрос 8': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     'Вопрос 9': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     'Вопрос 10': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     'Вопрос 11': {
#         'options': ['Вариант 1', 'Вариант 2'],
#         'answers': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         },
#         'follow_up': {
#             'Вариант 1': '',
#             'Вариант 2': ''
#         }
#     },
#     # Добавляем другие вопросы по мере необходимости
# }
