questions = [
    {
        'question': 'Количество посещенных занятий',
        'options': ['2', '3'],
        'answers': {
            '2': '',
            '3': '___ посетил все три занятия наших мини-курсов и'
        }
    },
    {
        'question': 'Принимал активное участие?',
        'options': ['Да', 'Нет'],
        'answers': {
            'Да': 'принимал активное участие',
            'Нет': 'Не принимал активное участие'
        }
    },
    {
        'question': 'Какое занятие он пропустил?',
        'options': ['Второе', 'Третье'],
        'answers': {
            'Второе': '____ посетил 2 занятия, к сожалению, пропустил второе. Однако, это вовсе не помешало ему довольно быстро сориентироваться, понять материал и решать задания по третьему уроку. Это очень здорово',
            'Третье': 'Пропустил третье занятие'
        }
    }
    # Добавляем другие вопросы по мере необходимости
]